output/2023-07-24-18-00.log
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.362 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1214000
HTML transferred:       1044000 bytes
Requests per second:    2761.68 [#/sec] (mean)
Time per request:       36.210 [ms] (mean)
Time per request:       0.362 [ms] (mean, across all concurrent requests)
Transfer rate:          3257.91 [Kbytes/sec] received
                        3274.10 kb/s sent
                        6532.01 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.8      0      11
Processing:     6   31  14.2     29      81
Waiting:        2   31  14.3     29      81
Total:          6   32  15.7     29      81
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.432 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1214000
HTML transferred:       1044000 bytes
Requests per second:    2316.87 [#/sec] (mean)
Time per request:       43.162 [ms] (mean)
Time per request:       0.432 [ms] (mean, across all concurrent requests)
Transfer rate:          2733.18 [Kbytes/sec] received
                        2746.76 kb/s sent
                        5479.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0       3
Processing:    10   41  17.3     36     118
Waiting:       10   41  17.3     36     118
Total:         10   41  17.3     39     118
Benchmark_Config
1000,100,2048
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        2068 bytes

Concurrency Level:      100
Time taken for tests:   0.361 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      2232000 bytes
Total body sent:        2238000
HTML transferred:       2068000 bytes
Requests per second:    2773.16 [#/sec] (mean)
Time per request:       36.060 [ms] (mean)
Time per request:       0.361 [ms] (mean, across all concurrent requests)
Transfer rate:          6044.63 [Kbytes/sec] received
                        6060.88 kb/s sent
                        12105.51 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       3
Processing:     4   35  25.1     27     160
Waiting:        4   35  25.1     27     160
Total:          4   35  25.0     27     160
Benchmark_Config
1000,100,4096
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        4116 bytes

Concurrency Level:      100
Time taken for tests:   0.274 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      4280000 bytes
Total body sent:        4286000
HTML transferred:       4116000 bytes
Requests per second:    3647.86 [#/sec] (mean)
Time per request:       27.413 [ms] (mean)
Time per request:       0.274 [ms] (mean, across all concurrent requests)
Transfer rate:          15246.93 [Kbytes/sec] received
                        15268.31 kb/s sent
                        30515.24 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0       4
Processing:     4   26  16.5     22      90
Waiting:        1   26  16.4     22      90
Total:          4   27  16.6     22      90
Benchmark_Config
1000,100,8192
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        8212 bytes

Concurrency Level:      100
Time taken for tests:   0.592 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      8376000 bytes
Total body sent:        8382000
HTML transferred:       8212000 bytes
Requests per second:    1689.01 [#/sec] (mean)
Time per request:       59.206 [ms] (mean)
Time per request:       0.592 [ms] (mean, across all concurrent requests)
Transfer rate:          13815.55 [Kbytes/sec] received
                        13825.44 kb/s sent
                        27640.99 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       4
Processing:     2   46  40.6     36     241
Waiting:        0   46  40.6     36     241
Total:          2   47  40.6     36     241
Benchmark_Config
1000,100,16384
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        16404 bytes

Concurrency Level:      100
Time taken for tests:   0.811 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      16569000 bytes
Total body sent:        16575000
HTML transferred:       16404000 bytes
Requests per second:    1233.40 [#/sec] (mean)
Time per request:       81.076 [ms] (mean)
Time per request:       0.811 [ms] (mean, across all concurrent requests)
Transfer rate:          19957.30 [Kbytes/sec] received
                        19964.53 kb/s sent
                        39921.84 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.3      0      18
Processing:    14   77  34.6     71     222
Waiting:       13   77  34.6     71     222
Total:         14   77  35.8     71     228
Benchmark_Config
1000,100,32768
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        32788 bytes

Concurrency Level:      100
Time taken for tests:   0.740 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      32953000 bytes
Total body sent:        32959000
HTML transferred:       32788000 bytes
Requests per second:    1350.56 [#/sec] (mean)
Time per request:       74.043 [ms] (mean)
Time per request:       0.740 [ms] (mean, across all concurrent requests)
Transfer rate:          43461.95 [Kbytes/sec] received
                        43469.87 kb/s sent
                        86931.82 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       5
Processing:     8   72  23.7     68     151
Waiting:        4   72  23.7     68     151
Total:          9   72  23.6     68     151
Benchmark_Config
1000,100,65536
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        65556 bytes

Concurrency Level:      100
Time taken for tests:   1.800 seconds
Complete requests:      1000
Failed requests:        13
   (Connect: 0, Receive: 0, Length: 13, Exceptions: 0)
Non-2xx responses:      13
Keep-Alive requests:    1000
Total transferred:      64869292 bytes
Total body sent:        65727000
HTML transferred:       64704162 bytes
Requests per second:    555.48 [#/sec] (mean)
Time per request:       180.025 [ms] (mean)
Time per request:       1.800 [ms] (mean, across all concurrent requests)
Transfer rate:          35188.96 [Kbytes/sec] received
                        35654.23 kb/s sent
                        70843.18 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.9      0       7
Processing:     6  146  77.8    127     633
Waiting:        2  146  77.8    127     633
Total:          7  146  77.9    129     633